#### Terraform Plan for live environment 📖 `success`

**_N.B. This plan doesn't reflect changes to the lambda source._**

<details><summary>Show Plan</summary>

```

random_password.end_of_day_username: Refreshing state... [id=none]
random_password.end_of_day_password: Refreshing state... [id=none]
aws_dynamodb_table.config: Refreshing state... [id=config]
aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:eu-west-2:755836339707:certificate/5f54120a-dd46-4652-857d-f0a796e8799d]
aws_dynamodb_table.token: Refreshing state... [id=token]
aws_cloudwatch_event_rule.match_fee_schedule: Refreshing state... [id=live-match-fee-transfer-schedule]
aws_api_gateway_rest_api.api: Refreshing state... [id=9d7wigd9k0]
aws_dynamodb_table.audit: Refreshing state... [id=live-audit]
aws_iam_role.lambda_iam_role: Refreshing state... [id=common-lambda-role-20220522195131837800000004]
aws_iam_role.match_fee_lambda_iam_role: Refreshing state... [id=match-fee-lambda-role-20220522195132826800000006]
aws_cloudwatch_event_rule.refresh_tokens_schedule: Refreshing state... [id=live-refresh-tokens-schedule]
aws_iam_role.end_of_day_lambda_iam_role: Refreshing state... [id=end-of-day-lambda-role-20220522195131837700000002]
aws_iam_role.queue_processor_lambda_iam_role: Refreshing state... [id=queue-processor-lambda-role-20220522195131837600000001]
aws_iam_policy.endpoint_logging_policy: Refreshing state... [id=arn:aws:iam::755836339707:policy/live/lambda/common-lambda-logging-20220522195132784700000005]
aws_sqs_queue.transactions: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/755836339707/live-transactions]
aws_route53_record.api_certificate_validation["api.accounting.mersthamcc.co.uk"]: Refreshing state... [id=Z047058117NM6D6MGKBNH__a438fda6ab65c1cc4dd2220a53c55bd8.api.accounting.mersthamcc.co.uk._CNAME]
module.sage_callback_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=k0dzcm]
module.purge_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=pyskzt]
module.end_of_day_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=hdotd7]
module.sage_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=q8yl1g]
module.purge_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-purge-unpaid-lambda]
aws_lambda_function.match_fee_lambda: Refreshing state... [id=live-match-fee-transfer-schedule]
aws_lambda_function.refresh_token_lambda: Refreshing state... [id=live-refresh-tokens-schedule]
aws_iam_role_policy_attachment.match_fee_lambda_logs: Refreshing state... [id=match-fee-lambda-role-20220522195132826800000006-2022052219513658280000000a]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=common-lambda-role-20220522195131837800000004-20220522195135532200000009]
module.sage_callback_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-9d7wigd9k0-k0dzcm-GET]
module.purge_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-9d7wigd9k0-pyskzt-POST]
aws_acm_certificate_validation.api: Refreshing state... [id=2022-05-22 19:52:11.669 +0000 UTC]
aws_iam_role_policy_attachment.end_of_day_lambda_logs: Refreshing state... [id=end-of-day-lambda-role-20220522195131837700000002-20220522195135221500000007]
time_sleep.wait_60_seconds: Refreshing state... [id=2022-05-22T19:52:57Z]
aws_dynamodb_table_item.config: Refreshing state... [id=config|id||live|]
module.end_of_day_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-9d7wigd9k0-hdotd7-POST]
module.sage_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-9d7wigd9k0-q8yl1g-GET]
aws_iam_policy.lambda_audit_dynamo_policy: Refreshing state... [id=arn:aws:iam::755836339707:policy/live/lambda/audit-lambda-dynamo-policy-2022052219514030170000000c]
aws_iam_role_policy_attachment.queue_processor_lambda_logs: Refreshing state... [id=queue-processor-lambda-role-20220522195131837600000001-20220522195135233900000008]
aws_lambda_function.process_transactions_sqs_lambda: Refreshing state... [id=live-transaction-sqs-lambda]
aws_iam_policy.lambda_dynamo_policy: Refreshing state... [id=arn:aws:iam::755836339707:policy/live/lambda/common-lambda-dynamo-policy-2022052219514030170000000b]
module.end_of_day_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-end-of-day-lambda]
aws_api_gateway_domain_name.api: Refreshing state... [id=api.accounting.mersthamcc.co.uk]
aws_sqs_queue_policy.process_transactions_queue_policy: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/755836339707/live-transactions]
aws_iam_role_policy_attachment.queue_processor_lambda_audit_dynamo: Refreshing state... [id=queue-processor-lambda-role-20220522195131837600000001-20220522195143481500000010]
aws_iam_role_policy_attachment.queue_processor_lambda_dynamo: Refreshing state... [id=queue-processor-lambda-role-20220522195131837600000001-2022052219514244750000000e]
aws_iam_role_policy_attachment.end_of_day_lambda_dynamo: Refreshing state... [id=end-of-day-lambda-role-20220522195131837700000002-20220522195143494700000011]
aws_iam_role_policy_attachment.match_fee_lambda_dynamo: Refreshing state... [id=match-fee-lambda-role-20220522195132826800000006-2022052219514243800000000d]
aws_iam_role_policy_attachment.lambda_dynamo: Refreshing state... [id=common-lambda-role-20220522195131837800000004-2022052219514244880000000f]
module.purge_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.purge_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-purge-unpaid-lambda]
module.purge_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-9d7wigd9k0-pyskzt-POST]
aws_route53_record.api: Refreshing state... [id=Z047058117NM6D6MGKBNH_api.accounting.mersthamcc.co.uk_A]
module.sage_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-sage-lambda]
module.sage_callback_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-sage-callback-lambda]
aws_lambda_permission.allow_cloudwatch_to_call_match_fee_lambda: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_log_group.match_fee_lambda_log_group: Refreshing state... [id=/aws/lambda/live-match-fee-transfer-schedule]
aws_cloudwatch_event_target.match_fee_schedule_target: Refreshing state... [id=live-match-fee-transfer-schedule-5]
aws_lambda_permission.allow_cloudwatch_to_call_refresh_tokens_lambda: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_log_group.refresh_token_lambda_log_group: Refreshing state... [id=/aws/lambda/live-refresh-tokens-schedule]
aws_cloudwatch_event_target.refresh_tokens_schedule_target: Refreshing state... [id=live-refresh-tokens-schedule-5]
aws_cloudwatch_log_group.sqs_transactions_log_group: Refreshing state... [id=/aws/lambda/live-transaction-sqs-lambda]
aws_lambda_event_source_mapping.lambda_sqs_mapping: Refreshing state... [id=54f5dcf6-9a9e-4900-8ea6-107f04c47fb2]
module.end_of_day_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.end_of_day_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-9d7wigd9k0-hdotd7-POST]
module.end_of_day_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-end-of-day-lambda]
module.sage_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-sage-lambda]
module.sage_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.sage_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-9d7wigd9k0-q8yl1g-GET]
module.sage_callback_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.sage_callback_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-sage-callback-lambda]
module.sage_callback_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-9d7wigd9k0-k0dzcm-GET]
aws_cloudwatch_log_metric_filter.transaction_processing_missing_tender_metric: Refreshing state... [id=live-transaction-processing-missing-tender-warning]
aws_cloudwatch_log_metric_filter.transaction_processing_error_metric: Refreshing state... [id=live-transaction-processing-errors]
aws_cloudwatch_log_metric_filter.transaction_processing_skip_metric: Refreshing state... [id=live-transaction-processing-skips]
aws_cloudwatch_log_metric_filter.transaction_processing_success_metric: Refreshing state... [id=live-transaction-processing-success]
aws_api_gateway_deployment.deployment: Refreshing state... [id=4wbnj8]
aws_api_gateway_stage.api_stage: Refreshing state... [id=ags-9d7wigd9k0-live]
aws_api_gateway_base_path_mapping.api: Refreshing state... [id=api.accounting.mersthamcc.co.uk/]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.allow_function_invoke will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_function_invoke"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowInvoke"
        }
    }

  # data.aws_iam_policy_document.email_queue_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "email_queue_policy_document"  {
      ~ id      = "2848884654" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "sqs:SendMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::755836339707:role/live/lambda/match-fee-lambda-role-20220522195132826800000006",
                              - "arn:aws:iam::755836339707:role/live/lambda/end-of-day-lambda-role-20220522195131837700000002",
                            ]
                        }
                      - Resource  = "arn:aws:sqs:eu-west-2:755836339707:live-transactions"
                      - Sid       = "SendSQS"
                    },
                  - {
                      - Action    = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::755836339707:role/live/lambda/queue-processor-lambda-role-20220522195131837600000001"
                        }
                      - Resource  = "arn:aws:sqs:eu-west-2:755836339707:live-transactions"
                      - Sid       = "ReceiveSQS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_cloudwatch_log_group.process_end_of_day_lambda_log_group will be created
  + resource "aws_cloudwatch_log_group" "process_end_of_day_lambda_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/live-end-of-day-processor"
      + retention_in_days = 90
      + tags_all          = {
          + "Application" = "accounts-api"
          + "Environment" = "live"
        }
    }

  # aws_iam_policy.invoke_processor_policy will be created
  + resource "aws_iam_policy" "invoke_processor_policy" {
      + arn         = (known after apply)
      + description = "IAM policy to allow invocation of the end of day processor function"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "invoke-processor-"
      + path        = "/live/lambda/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application" = "accounts-api"
          + "Environment" = "live"
        }
    }

  # aws_iam_role.end_of_day_endpoint_lambda_iam_role will be created
  + resource "aws_iam_role" "end_of_day_endpoint_lambda_iam_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "end-of-day-lambda-role-"
      + path                  = "/live/lambda/"
      + tags_all              = {
          + "Application" = "accounts-api"
          + "Environment" = "live"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.end_of_day_endpoint_lambda_dynamo will be created
  + resource "aws_iam_role_policy_attachment" "end_of_day_endpoint_lambda_dynamo" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::755836339707:policy/live/lambda/common-lambda-dynamo-policy-2022052219514030170000000b"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.end_of_day_endpoint_lambda_invoke will be created
  + resource "aws_iam_role_policy_attachment" "end_of_day_endpoint_lambda_invoke" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.end_of_day_endpoint_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "end_of_day_endpoint_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::755836339707:policy/live/lambda/common-lambda-logging-20220522195132784700000005"
      + role       = (known after apply)
    }

  # aws_lambda_event_source_mapping.lambda_sqs_mapping will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "lambda_sqs_mapping" {
      ~ batch_size                         = 1 -> 250
        id                                 = "54f5dcf6-9a9e-4900-8ea6-107f04c47fb2"
      ~ maximum_batching_window_in_seconds = 0 -> 300
        # (16 unchanged attributes hidden)
    }

  # aws_lambda_function.process_end_of_day_lambda will be created
  + resource "aws_lambda_function" "process_end_of_day_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "live-end-of-day-processor"
      + handler                        = "cricket.merstham.website.accounts.lambda.ProcessEndOfDay::handleRequest"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 3072
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::755836339707:role/live/lambda/end-of-day-lambda-role-20220522195131837700000002"
      + runtime                        = "java11"
      + s3_bucket                      = "mersthamcc-accounts-deployment-versioned"
      + s3_key                         = "accounts.zip"
      + s3_object_version              = "eJv.SGcCAoBdM_EwUa9WPX3uC_thAEpJ"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "accounts-api"
          + "Environment" = "live"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CONFIG_NAME" = "live"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.process_transactions_sqs_lambda will be updated in-place
  ~ resource "aws_lambda_function" "process_transactions_sqs_lambda" {
        id                             = "live-transaction-sqs-lambda"
      ~ memory_size                    = 512 -> 2048
        tags                           = {}
        # (21 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_sqs_queue.transactions will be updated in-place
  ~ resource "aws_sqs_queue" "transactions" {
        id                                = "https://sqs.eu-west-2.amazonaws.com/755836339707/live-transactions"
        name                              = "live-transactions"
      + redrive_policy                    = (known after apply)
        tags                              = {}
        # (13 unchanged attributes hidden)
    }

  # aws_sqs_queue.transactions_dlq will be created
  + resource "aws_sqs_queue" "transactions_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "live-transactions-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags_all                          = {
          + "Application" = "accounts-api"
          + "Environment" = "live"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue_policy.process_transactions_queue_policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "process_transactions_queue_policy" {
        id        = "https://sqs.eu-west-2.amazonaws.com/755836339707/live-transactions"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "sqs:SendMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::755836339707:role/live/lambda/match-fee-lambda-role-20220522195132826800000006",
                              - "arn:aws:iam::755836339707:role/live/lambda/end-of-day-lambda-role-20220522195131837700000002",
                            ]
                        }
                      - Resource  = "arn:aws:sqs:eu-west-2:755836339707:live-transactions"
                      - Sid       = "SendSQS"
                    },
                  - {
                      - Action    = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::755836339707:role/live/lambda/queue-processor-lambda-role-20220522195131837600000001"
                        }
                      - Resource  = "arn:aws:sqs:eu-west-2:755836339707:live-transactions"
                      - Sid       = "ReceiveSQS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.end_of_day_endpoint.aws_lambda_function.endpoint_lambda will be updated in-place
  ~ resource "aws_lambda_function" "endpoint_lambda" {
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
        id                             = "live-end-of-day-lambda"
      - image_uri                      = "" -> null
      - kms_key_arn                    = "" -> null
      ~ memory_size                    = 512 -> 3072
      ~ role                           = "arn:aws:iam::755836339707:role/live/lambda/end-of-day-lambda-role-20220522195131837700000002" -> (known after apply)
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
        tags                           = {}
      ~ timeout                        = 30 -> 300
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONFIG_NAME"     = "live"
              - "END_OF_DAY_AUTH" = (sensitive)
            } -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.purge_endpoint.aws_lambda_function.endpoint_lambda will be updated in-place
  ~ resource "aws_lambda_function" "endpoint_lambda" {
        id                             = "live-purge-unpaid-lambda"
      ~ memory_size                    = 512 -> 3072
        tags                           = {}
        # (27 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.sage_callback_endpoint.aws_lambda_function.endpoint_lambda will be updated in-place
  ~ resource "aws_lambda_function" "endpoint_lambda" {
        id                             = "live-sage-callback-lambda"
      ~ memory_size                    = 512 -> 3072
        tags                           = {}
        # (21 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.sage_endpoint.aws_lambda_function.endpoint_lambda will be updated in-place
  ~ resource "aws_lambda_function" "endpoint_lambda" {
        id                             = "live-sage-lambda"
      ~ memory_size                    = 512 -> 3072
        tags                           = {}
        # (21 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 8 to add, 8 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>